Revit 2026 API

# MacroManagerIteratorGetCurrent Method

---

Returns the current Macro module.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MacroModule GetCurrent()
```
```vb
Public Function GetCurrent As MacroModule
```
```cpp
public:
MacroModule^ GetCurrent()
```
```fsharp
member GetCurrent : unit -> MacroModule
```

#### Return Value

MacroModule The current Macro module.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

#### Reference

MacroManagerIterator Class

Autodesk.Revit.DB.Macros Namespace